HarrisonAllen/Wireless-Controllers-for-Microelectronic-Fibers/Version 2/NRF52840 Development Kit Firmware/main_1_1.c
    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_nus_uuid);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_nus_c_on_db_disc_evt(&m_ble_nus_c[p_evt->conn_handle], p_evt);
}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
 *
 * @details This function takes a list of characters of length data_len and prints the characters out on UART.
 *          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print(uint8_t * p_data, uint16_t data_len)
{
    ret_code_t ret_val;

    NRF_LOG_DEBUG("Receiving data.");
    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);
    //printf("received %d\r\n",data_len);
    memset(send_buffer, 0, sizeof(send_buffer));
    
    if (p_data[3] == 'D') {
      // TODO: Make this so that it copies the prefix (BEFORE '~'), and then parses everything AFTER '~' as data,
      // This way it will work with future schemes, and there shouldn't be a ~ in the prefix or data otherwise
      // What we're gonna do:
      // 1. Send one piece of data at a time, as 000D$XXXXX\r\n
      // 2. And on the UI end, it will know to append that data to whatever data is currently measured
      //printf("Data %s\r\n", p_data);
      snprintf(send_buffer, 6, "%s", p_data);
      //printf("Buffer %s\r\n", send_buffer);
      uint8_t *data_begin = &p_data[5];
      unsigned short * converted_data = (unsigned short *) data_begin;
      unsigned char number_len;
      unsigned short arr_pos = 5;
      for (int i = 0; i < (data_len / 2) - 5; i++) {
        //sprintf(&send_buffer[5+i*6], "%05d,", converted_data[i]);
        sprintf(&send_buffer[arr_pos], "%d,", converted_data[i]);
        arr_pos += (int)(log10(converted_data[i])+1)+1;
      }
      printf("%s\r\n", send_buffer);
      //unsigned short * converted_data = (unsigned short *) data_begin;
      //for (int i = 0; i < (data_len / 2) - 5; i++) {
      //  printf("%s%05d\r\n", send_buffer, converted_data[i]);
      //}


      //printf("Received data, need further parsing\r\n");
//     short int * current_data = (short int *) p_data;
// //    long int * time_data = (long int *) p_data;
//     if (data_len == 200){
// //      printf("%10d\r\n", time_data[0]);
//       for (uint32_t i = 0; i < 100; i++){
//         printf("%05d\r\n", current_data[i]);
//       }
//       //printf("%02x %02x %02x %02x %02x %02x %02x %02x\n", p_data[1], p_data[0],p_data[3], p_data[2], p_data[5], p_data[4],p_data[7], p_data[6]);
//     }
    } else {
      // For some reason, just printfing the p_data adds some junk characters,
      // so first copy only the data to a buffer, then send
      char send_buffer[data_len + 5]; // A bit extra, just in case
      snprintf(send_buffer, data_len+1, "%s", p_data);
      printf("%s\r\n", send_buffer);
    }

    // Spit everything out over serial
    //printf("%s\r\n", p_data);

    // The old hardcoded way
//     //printf("%03d\r\n", data_len);
// //    if (data_len < 5){
// //      NRF_LOG_INFO("data %d",p_data[0]);
// //    }
// //    printf("data %s",p_data);
//     short int * current_data = (short int *) p_data;
// //    long int * time_data = (long int *) p_data;
//     if (data_len == 200){
// //      printf("%10d\r\n", time_data[0]);
//       for (uint32_t i = 0; i < 100; i++){
//         printf("%05d\r\n", current_data[i]);
//       }
//       //printf("%02x %02x %02x %02x %02x %02x %02x %02x\n", p_data[1], p_data[0],p_data[3], p_data[2], p_data[5], p_data[4],p_data[7], p_data[6]);
//     }
//     else {
//       for (uint32_t i = 0; i < 8; i++){
//         printf("%03d\r\n", p_data[i]);
//       }
//     }
    
    // The even older original example way
//    for (uint32_t i = 0; i < data_len; i++)
//    {
//        do
//        {
//            ret_val = app_uart_put(p_data[i]);
//            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
//            {
//                NRF_LOG_ERROR("app_uart_put failed for index 0x%04x.", i);
//                APP_ERROR_CHECK(ret_val);
//            }
//        } while (ret_val == NRF_ERROR_BUSY);
//    }
//    if (p_data[data_len-1] == '\r')
//    {
//        while (app_uart_put('\n') == NRF_ERROR_BUSY);
//    }
    //if (ECHOBACK_BLE_UART_DATA)
    //{
    //    // Send data back to the peripheral.
    //    do
    //    {
    //        ret_val = ble_nus_c_string_send(&m_ble_nus_c[p_evt->conn_handle], p_data, data_len);
    //        if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
    //        {
    //            NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x. ", ret_val);
    //            APP_ERROR_CHECK(ret_val);
    //        }
    //    } while (ret_val == NRF_ERROR_BUSY);
    //}
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module and appends it to
 *          a string. The string is sent over BLE when the last character received is a
 *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
 */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    uint32_t ret_val;

    switch (p_event->evt_type)
    {
        /**@snippet [Handling data from UART] */
        // Back to original, send data to every module
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;
            
            // Original code includes "|| [] == '\n'" as a conditional, but that 
            // made it send data twice, thus getting double responses
            if ((data_array[index - 1] == '\r') ||
                (index >= (m_ble_nus_max_data_len)))
            {
                //printf("Sending to module\r\n");
                NRF_LOG_INFO("Ready to send data over BLE NUS");
                NRF_LOG_HEXDUMP_DEBUG(data_array, index);

