HarrisonAllen/Wireless-Controllers-for-Microelectronic-Fibers/Version 2/NRF52840 Development Kit Firmware/main_1_1.c
                for(int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
                {
                    do
                    {
                        ret_val = ble_nus_c_string_send(&m_ble_nus_c[c], data_array, index);
                        if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
                        {
                            APP_ERROR_CHECK(ret_val);
                        }
                    } while (ret_val == NRF_ERROR_RESOURCES);
                }
                index = 0;
            }
            break;

        // Old version, tried sending to specific modules
        // case APP_UART_DATA_READY:
        //     UNUSED_VARIABLE(app_uart_get(&data_array[index]));
        //     index++;
          
        //     //printf("Input :%c\n", data_array[index - 1]);
        //     //printf("Does %d equal %d\n", '\r', data_array[index - 1]);
        //     //printf(data_array[index - 2]);
        //     if ((data_array[index - 1] == '\r') || (index >= (m_ble_nus_max_data_len)))
        //     {
        //         NRF_LOG_INFO("%d,%d", data_array, index);
        //         NRF_LOG_DEBUG("Ready to send data over BLE NUS");
        //         NRF_LOG_INFO("%s,%d", data_array, index);
        //         NRF_LOG_HEXDUMP_DEBUG(data_array, index);
        //         char periph_str[2];
        //         sprintf(periph_str, "%c", data_array[0]);
        //         printf("Data to send: %s\r\n", data_array);
        //         uint8_t peripheral_num = data_array[0] - '0';
        //         printf("Sending data to peripheral %d\r\n", peripheral_num);
        //         do
        //         {
        //             ret_val = ble_nus_c_string_send(&m_ble_nus_c[peripheral_num], data_array+1, index-1);
        //             if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
        //             {
        //                 APP_ERROR_CHECK(ret_val);
        //             }
        //         } while (ret_val == NRF_ERROR_RESOURCES);
        //         index = 0;
             
        //     }
        //     break;

        /**@snippet [Handling data from UART] */
        case APP_UART_COMMUNICATION_ERROR:
            NRF_LOG_ERROR("Communication error occurred while handling UART.");
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}


/**@brief Callback handling Nordic UART Service (NUS) client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
 * @param[in]   p_ble_nus_evt Pointer to the NUS client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, ble_nus_c_evt_t const * p_ble_nus_evt)
{
    ret_code_t err_code;

    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
            NRF_LOG_INFO("Discovery complete.");
            err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
            APP_ERROR_CHECK(err_code);

            err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Connected to device with Nordic UART Service.");
            // Just tell GUI that we're connected, then GUI will poll modules
            printf("Connected\r\n");
            // Old version, included ID with connection message
            // printf("Connected,%d\r\n", p_ble_nus_c->conn_handle);
            break;

        case BLE_NUS_C_EVT_NUS_TX_EVT:
            ble_nus_chars_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
            scan_start();
            break;
    }
}
/**@snippet [Handling events from the ble_nus_c module] */


/**
 * @brief Function for handling shutdown events.
 *
 * @param[in]   event       Shutdown type.
 */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
            // Prepare wakeup buttons.
            err_code = bsp_btn_ble_sleep_mode_prepare();
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }

    return true;
}

NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, APP_SHUTDOWN_HANDLER_PRIORITY);


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t            err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            err_code = ble_nus_c_handles_assign(&m_ble_nus_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
            APP_ERROR_CHECK(err_code);

            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);

            // start discovery of services. The NUS Client waits for a discovery result
            err_code = ble_db_discovery_start(&m_db_disc, p_gap_evt->conn_handle);
            APP_ERROR_CHECK(err_code);

            // New
            if (ble_conn_state_central_conn_count() < NRF_SDH_BLE_CENTRAL_LINK_COUNT)
            {
                // Resume scanning.
                scan_start();
            }
            // Old
            // Update LEDs status and check whether it is needed to look for more
            // peripherals to connect to.
            // //bsp_board_led_on(CENTRAL_CONNECTED_LED);
            // if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
            // {
            //     //bsp_board_led_off(CENTRAL_SCANNING_LED);
            //     printf("Max links hit\r\n");
            // }
            // else
            // {
            //     // Resume scanning.
            //     //bsp_board_led_on(CENTRAL_SCANNING_LED);
            //     //scan_start(); // Uncomment this line to reenable multiple simultaneous connections
            // }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            // New, let GUI handle polling
            printf("Disconnected\r\n");

            // Old, included ID
            // printf("Disconnected,%d\r\n", p_gap_evt->conn_handle);

